num <- 1:37
a <- c(0.46, 0.52, 0.86, 0.91, 0.54, 
       0.64, 0.67, 0.74, 0.69, 0.61, 
       0.65, 0.53, 0.76,
       0.41, 0.33, 0.41, 0.28, 0.39, 
       0.36, 0.40, 0.67, 0.39, 0.33, 
       0.56,0.61, 0.18, 0.59, 0.23,
       0.09, 0.22, 0.27, 0.40, 0.27, 
       0.06, 0.30, 0.36, 0,42)
b <- c("Северный", "Северный", "Северный", 
       "Северный", "Северный", "Северный", 
       "Северный", "Северный", "Северный", 
       "Северный", "Северный", "Северный", "Северный",
       "Средняя полоса", "Средняя полоса", "Средняя полоса",
       "Средняя полоса", "Средняя полоса", "Средняя полоса",
       "Средняя полоса", "Средняя полоса", "Средняя полоса",
       "Средняя полоса", "Средняя полоса", "Средняя полоса",
       "Средняя полоса", "Средняя полоса", "Средняя полоса",
       "Южный", "Южный", "Южный",
       "Южный", "Южный", "Южный",
       "Южный", "Южный", "Южный")

b_factor <- factor(b)

print(a)
print(b)
print(b_factor)
